[
    {
      "_id": "65a52ce0b90cbeaf9953933a",
      "timePosted": "2024-01-15T17:02:24.186Z",
      "author": "Lilach",
      "title": "So tired",
      "content": "Exhaustion seeped into every bone as another sleepless night unfolded, marked by the muffled cries of my little one. My baby girl, once again engulfed in the clutches of illness, tugged at the strings of my weary heart. The dim glow of the night lamp revealed a room filled with a mother's tender touch, soothing lullabies, and an ever-present worry etched across my face. Fatigue battled against the innate strength that motherhood imparts. As I cradled her tiny form, whispering words of comfort into the quiet darkness, the silent hope for a healthier dawn resonated through the room.",
      "__v": 18,
      "likes": [
        "65a3c5949cf598266bddf6d0",
        "65a3d57b71ab1bbab67d58a8"
      ]
    },
    {
      "_id": "65a5328f827722afc4acd3d5",
      "timePosted": "2023-11-29T15:05:05.712Z",
      "author": "Loki",
      "title": "Meow-diary",
      "content": "Today marked another chapter in my epic quest for the divine treasures concealed within the sacred metallic vessels. The rhythmic purr-chants of the mysterious can opener echoed through the kitchen, and my whiskers quivered in response.\n\nAs the metallic gates of gastronomic delight parted ways, a fragrant symphony enveloped the room. Ah, the sweet promise of canned ambrosia! With eyes aglow, I, Loki, stood witness to the unveiling of feline paradise.\n\nThe delectable aroma danced through the air, a mesmerizing ballet for my discerning senses. Each can, a portal to a world of flavor, held the potential for unparalleled satisfaction.\n\nIn my feline escapade through the culinary cosmos, I declare: \"Canned food, thou art a sacred offering, a daily indulgence fit for the regal palate of Loki.\"\n\nWhisker-twitchingly Yours,\nLoki",
      "__v": 1,
      "likes": [
        "65a3d57b71ab1bbab67d58a8"
      ]
    },
    {
      "_id": "65a548ca025ffa1861125b82",
      "timePosted": "2024-01-12T00:01:30.640Z",
      "author": "Assaf",
      "title": "Project is going slow",
      "content": "Today's coding journey unfolded at a pace reminiscent of a sluggish river. My Node.js project, initially embarked upon with fervor, has hit a patch of stagnation. Lines of code, once fluid, now seem to drag their feet through the vast expanse of asynchronous challenges.\n\nDebugging sessions morph into contemplative pauses, and the console output becomes a slow, deliberate heartbeat of frustration. As I navigate the intricacies of callbacks and promises, the progress bar of my project inches forward, echoing the hesitant rhythm of a hesitant coder.\n\nYet, amidst the lingering uncertainties, there is a silent determination. Each slow step forward is a conquest, a testament to resilience in the face of intricate complexities. The Node.js project may be moving at a crawl, but it's the persistence that keeps the gears turning, albeit gradually. Tomorrow holds the promise of acceleration; today, I navigate the currents of coding at a steady, if not swift, pace.",
      "__v": 1,
      "likes": [
        "65a3d57b71ab1bbab67d58a8"
      ]
    },
    {
      "_id": "65a54c41025ffa1861125bac",
      "timePosted": "2023-12-15T11:16:17.293Z",
      "author": "Meir",
      "title": "Microphone doesn't work well",
      "content": "T$$ay's t$.. troub!es reached a cres...&o as my attempts to fix the elusive micr$%# glitch hit a d##d end. Frstr#&i!&$ ech##d in th$ si!#nt void of failed audi$# tests. Th$ rabbit hl# of forums and troubleshoot&$ guides d#epen$d, yet th$ mic remined si!#nt. A dan## of cabl$s and settings e!su$d, a futile ritu!l in th$ qu#st for a voic$. Th$ struggl$ co!tinu$s, th$ h#mbling ackn#$@%$#ledgment that, so!$times, th$ $@#st elusive so!#utions r$&!ide just b$yond r#$%ch.",
      "__v": 1,
      "likes": [
        "65a3d57b71ab1bbab67d58a8"
      ]
    },
    {
      "_id": "65a54caf025ffa1861125bbd",
      "timePosted": "2023-12-30T19:56:07.889Z",
      "author": "Lilach",
      "title": "My first chapter!",
      "content": "Today marked a transformative journey of self-discovery. Reflecting on moments of growth and introspection, I uncovered hidden strengths within. Gratitude for the challenges that sculpted my resilience. As the sun sets, I embrace the evolving chapters, eager for the unwritten pages that await.",
      "__v": 1,
      "likes": [
        "65a3d57b71ab1bbab67d58a8"
      ]
    },
    {
      "_id": "65a54cfa025ffa1861125bc7",
      "timePosted": "2024-01-13T12:04:22.872Z",
      "author": "Assaf",
      "title": "Sick again...",
      "content": "Frustration mounts as I find myself confined to the familiar four walls of my room once again. A persistent illness, like an unwelcome guest, has returned to disrupt my academic pursuits. The coughs echo the setbacks, and the sniffles create a rhythm of discontent. Amidst the sniffed tissues and aching limbs, the desire for a healthier tomorrow persists, carrying the weight of missed lectures and assignments. Another day of healing, another page in the journal of resilience.",
      "__v": 3,
      "likes": [
        "65a3d57b71ab1bbab67d58a8"
      ]
    },
    {
      "_id": "65a54d31025ffa1861125bd1",
      "timePosted": "2024-01-01T20:20:17.273Z",
      "author": "Yotam",
      "title": "Still behind",
      "content": "Feeling the weight of deadlines pressing down as I navigate the Node.js class, the struggle is palpable. Falling behind on modules and struggling to catch up, the lines of code blur into an overwhelming sea of confusion. Determination fuels late-night coding sessions, but the challenge is real. Each setback is a lesson, and with resilience, I'm determined to bridge the gap and grasp the intricacies of Node.js.",
      "__v": 1,
      "likes": [
        "65a3d57b71ab1bbab67d58a8"
      ]
    },
    {
      "_id": "65a54d7d025ffa1861125bdb",
      "timePosted": "2024-01-14T09:17:33.190Z",
      "author": "Omer",
      "title": "Teaching Node.js",
      "content": "In the classroom today, the energy pulsed with the excitement of Node.js exploration. Guiding eager minds through the intricacies of asynchronous JavaScript, we delved into event-driven programming and the magic of the event loop. Witnessing the spark of understanding in my students fuels my passion for teaching this dynamic technology.",
      "__v": 3,
      "likes": [
        "65a3d57b71ab1bbab67d58a8"
      ]
    },
    {
      "_id": "65a54dbc025ffa1861125beb",
      "timePosted": "2024-01-10T08:12:36.672Z",
      "author": "Assaf",
      "title": "Cat won't get out of the kitchen sink",
      "content": "Frustration tinged with amusement today as my mischievous feline companion, Whiskers, persistently claimed the kitchen sink as her favorite spot. Despite numerous attempts to dissuade her, the allure of that stainless-steel basin proved irresistible. Our ongoing battle for sink supremacy has become a humorous daily ritual, a reminder of the whimsical quirks that make life with a cat endlessly entertaining.",
      "__v": 1,
      "likes": [
        "65a3d57b71ab1bbab67d58a8"
      ]
    },
    {
      "_id": "65a54dda025ffa1861125bf1",
      "timePosted": "2024-01-15T15:23:06.162Z",
      "author": "Gilad",
      "title": "Too focused",
      "content": "A twist of irony unfolded as I eagerly consumed Ritalin before my Node.js class, aiming to conquer the intricacies of asynchronous programming. Upon arrival, a stark realization hit—class canceled. The enhanced focus lingered, a caffeine-like buzz without an outlet. Lesson learned: always check for updates before diving into stimulants, for unpredictability can be the true master of irony.",
      "__v": 1,
      "likes": [
        "65a3d57b71ab1bbab67d58a8"
      ]
    }
  ]